src/Catalogs/ПолисыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПолисыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПолиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаПрикрепления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПолисыМедицинскогоСтрахования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, Обработчик "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ОтображатьКод = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	
	Элементы.Код.Видимость          = ОтображатьКод;
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображатьКод, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	Элементы.Контрагент.ТолькоПросмотр = Параметры.Свойство("КотрагентТолькоПросмотр") И Параметры.КотрагентТолькоПросмотр;
	Элементы.ВалютаУчета.Заголовок     = Строка(Объект.СтраховаяКомпания.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств);
	Если Параметры.Свойство("Контрагент") И ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		
		Объект.Контрагент = Параметры.Контрагент;
		Элементы.Контрагент.Видимость = Ложь;
		
	КонецЕсли; 
	
	Если Параметры.Свойство("СтраховаяКомпания")
		И НЕ ЗначениеЗаполнено(Объект.СтраховаяКомпания) Тогда
		Объект.СтраховаяКомпания = Параметры.СтраховаяКомпания;	
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая()
		И Объект.ЛимитПолиса > 0 Тогда
		ПостроитьТаблицуИсторииОбъекта();	
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СозданПолисМедСтрахования");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СтраховаяКомпанияПриИзменении(Элемент) 
	
	СформироватьНаименование(); 
	
КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура НомерПолисаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ДанаНачалаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ДатаОкончанияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиКомандФормы  
  
&НаКлиенте
// Процедура, обработчика команды "закрыть".
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтаФорма.Записать();
	Закрыть();
	Оповестить("СозданПолисМедСтрахования");

КонецПроцедуры

#КонецОбласти 

#Область ИсторияОбъекта

&НаСервере
// Процедура - Построить таблицу истории объекта.
//
Процедура ПостроитьТаблицуИсторииОбъекта()
	
	УстановитьПривилегированныйРежим(Истина);
		
	ТаблицаОпераций = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьИсториюСписанияПолиса(Объект.Ссылка);
	
	ЭтотОбъект.ТаблицаИсторииОбъекта.Загрузить(ТаблицаОпераций);
	
	Остаток = Объект.ЛимитПолиса - ТаблицаОпераций.Итог("Сумма");
	
	Группа_Строки_История = Элементы.Добавить("ГруппаКнопки_Строки_История", Тип("ГруппаФормы"), Элементы.ГруппаИстория);
	Группа_Строки_История.Вид 												= ВидГруппыФормы.ОбычнаяГруппа;
	Группа_Строки_История.Заголовок 										= Группа_Строки_История.Имя;
	Группа_Строки_История.Отображение 										= ОтображениеОбычнойГруппы.Нет;
	Группа_Строки_История.Группировка 										= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_Строки_История.ОтображатьЗаголовок 								= Ложь;		
	Группа_Строки_История.ЦветФона 											= Новый Цвет(254,254,254);
	Группа_Строки_История.РастягиватьПоГоризонтали 							= Истина;
	Группа_Строки_История.ВертикальноеПоложениеПодчиненных					= ВертикальноеПоложениеЭлемента.Центр;
	Группа_Строки_История.ГоризонтальныйИнтервал 							= ИнтервалМеждуЭлементамиФормы.Нет;
	
	//Декорация                          			= Элементы.Добавить("ДекорацияИсторияЗаголовокПериод", Тип("ДекорацияФормы"),  Элементы.ГруппаКнопки);
	Декорация                          				= Элементы.Добавить("ДекорацияИсторияЗаголовокПериод", Тип("ДекорацияФормы"),  Группа_Строки_История);	
	Декорация.Заголовок                				= НСтр("ru= 'Остаток';en ='Balance'");
	Декорация.Шрифт                    				= Новый Шрифт(Декорация.Шрифт,,11);
	Декорация.ЦветТекста               				= Новый Цвет(30,144,255);
	Декорация.АвтоМаксимальнаяШирина   				= Ложь;
	Декорация.МаксимальнаяШирина       				= 0;
	Декорация.РастягиватьПоГоризонтали 				= Истина;
	Декорация.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Лево;
	Декорация.ГоризонтальноеПоложение 				= ГоризонтальноеПоложениеЭлемента.Лево;
	Декорация.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
	Декорация.ВертикальноеПоложение 				= ВертикальноеПоложениеЭлемента.Центр;
	
	//Декорация                           			= Элементы.Вставить("ДекорацияИсторияЗаголовокСумма", Тип("ДекорацияФормы"),  Элементы.ГруппаСуммы);
	Декорация                           			= Элементы.Вставить("ДекорацияИсторияЗаголовокСумма", Тип("ДекорацияФормы"),  Группа_Строки_История);	
	Декорация.Заголовок                 			= Формат(Остаток, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	Декорация.Шрифт                     			= Новый Шрифт(Декорация.Шрифт,,11);
	Декорация.ЦветТекста                			= Новый Цвет(30,144,255);
	Декорация.Ширина                    			= 8;
	Декорация.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Право;
	Декорация.ГоризонтальноеПоложение 				= ГоризонтальноеПоложениеЭлемента.Право;
	Декорация.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
	Декорация.ВертикальноеПоложение 				= ВертикальноеПоложениеЭлемента.Центр;
	
	// Декорация черта
	ДекорацияЧерта                           		= Элементы.Вставить("Декорация_Черта", Тип("ДекорацияФормы"), Элементы.ГруппаИстория);		
	ДекорацияЧерта.Заголовок                 		= "";
	ДекорацияЧерта.Шрифт                 			= Новый Шрифт(ДекорацияЧерта.Шрифт,,1);
	ДекорацияЧерта.Рамка                            = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху);
	ДекорацияЧерта.АвтоМаксимальнаяШирина 			= Ложь;
	ДекорацияЧерта.МаксимальнаяШирина       		= 0;
	ДекорацияЧерта.РастягиватьПоГоризонтали 		= Истина;
	
	Четная = Ложь;
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаИсторииОбъекта Цикл
		Четная = НЕ Четная;
		ИдЭлементов = СтрЗаменить(Строка(СтрокаТ.ПолучитьИдентификатор()), Символы.НПП, "");
		
		Группа_Строки_История = Элементы.Добавить("Группа_Строки_История_" + ИдЭлементов, Тип("ГруппаФормы"), Элементы.ГруппаИстория);
		Группа_Строки_История.Вид 												= ВидГруппыФормы.ОбычнаяГруппа;
		Группа_Строки_История.Заголовок 										= Группа_Строки_История.Имя;
		Группа_Строки_История.Отображение 										= ОтображениеОбычнойГруппы.Нет;
		Группа_Строки_История.Группировка 										= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Группа_Строки_История.ОтображатьЗаголовок 								= Ложь;		
		Группа_Строки_История.ЦветФона 											= ?(Четная, Новый Цвет(240,240,240), Новый Цвет(254,254,254));
		Группа_Строки_История.РастягиватьПоГоризонтали 							= Истина;
		Группа_Строки_История.ВертикальноеПоложениеПодчиненных 					= ВертикальноеПоложениеЭлемента.Центр;
		Группа_Строки_История.ГоризонтальныйИнтервал 							= ИнтервалМеждуЭлементамиФормы.Нет;
		
		КомандаФормы          = ЭтаФорма.Команды.Добавить("КнопкаИсторияПериод_" + ИдЭлементов);
		КомандаФормы.Действие = "ОбработчикНажатияПоОперацииИстории";
		
		//Кнопка                  					= Элементы.Добавить("КнопкаИсторияПериод_" + ИдЭлементов, Тип("КнопкаФормы"), Элементы.ГруппаКнопки);
		Кнопка                   					= Элементы.Добавить("КнопкаИсторияПериод_" + ИдЭлементов, Тип("КнопкаФормы"), Группа_Строки_История);			
		Кнопка.Заголовок         					= НаименованиеЗаголовкаОперации(СтрокаТ);
		Кнопка.ИмяКоманды        					= КомандаФормы.Имя;	
		Кнопка.ОтображениеФигуры 					= ОтображениеФигурыКнопки.Нет;
		Кнопка.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Лево;
		Кнопка.ВертикальноеПоложениеВГруппе 		= ВертикальноеПоложениеЭлемента.Центр;
		
		//Декорация                           		= Элементы.Вставить("ДекорацияИсторияСумма_" + ИдЭлементов, Тип("ДекорацияФормы"), Элементы.ГруппаСуммы);
		Декорация                           		= Элементы.Вставить("ДекорацияИсторияСумма_" + ИдЭлементов, Тип("ДекорацияФормы"), Группа_Строки_История);		
		Декорация.Заголовок                 		= Формат(СтрокаТ.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=-");
		Декорация.Ширина                    		= 8;
		//Декорация.Высота 							= 2;
		Декорация.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
		Декорация.ГоризонтальноеПоложение 			= ГоризонтальноеПоложениеЭлемента.Право;
		Декорация.ВертикальноеПоложениеВГруппе 		= ВертикальноеПоложениеЭлемента.Центр;
		Декорация.ВертикальноеПоложение 			= ВертикальноеПоложениеЭлемента.Центр;		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Функция - Наименование заголовка операции.
//
Функция НаименованиеЗаголовкаОперации(СтрокаИстории)
	
	Возврат Формат(СтрокаИстории.Период, "ДФ='dd.MM.yyyy  :  HH:mm'") + "       "  + СтрокаИстории.Операция;	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события нажатия кнопок.
//
Процедура ОбработчикНажатияПоОперацииИстории(Элемент)
	
	Идентификатор = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);
	ПоказатьЗначение(, ЭтотОбъект.ТаблицаИсторииОбъекта.НайтиПоИдентификатору(Идентификатор).Регистратор);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента.
//
Функция ИдентификаторСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование()
	
	Объект.Наименование = РеквизитФормыВЗначение("Объект").СформироватьНаименование();
	Элементы.ВалютаУчета.Заголовок = Строка(Объект.СтраховаяКомпания.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств);
	
КонецПроцедуры

#КонецОбласти
